Revit 2026 API

# IntersectionResult Class

---

This class captures results of intersecting geometric entities. "Intersecting" is meant in generalized sense, so the same class will be used for projection, containment, etc. Refer to the documentation of the method providing the result for the precise meaning of properties.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBIntersectionResult

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IntersectionResult : APIObject
```
```vb
Public Class IntersectionResult
	Inherits APIObject
```
```cpp
public ref class IntersectionResult : public APIObject
```
```fsharp
type IntersectionResult =
    class
        inherit APIObject
    end
```

The IntersectionResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IntersectionResult | Initializes a new instance of the IntersectionResult class |

|  | Name | Description |
| --- | --- | --- |
|  | Distance | Distance from the original object to located point. |
|  | EdgeObject | Edge of the face close to the point of intersection. |
|  | EdgeParameter | Parameter of a point on the edge closest to the point of intersection. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | Parameter | 1d parameter of the point of intersection. |
|  | UVPoint | 2d (or two 1d) parameters of the point of intersection. |
|  | XYZPoint | Point of intersection in local 3d coordinates. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace